In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv("student_performance_2.csv")

In [4]:
df.isnull()

,Student ID,Gender,Age,School,Math Score,Reading Score,Writing Score,Class Performance
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
6995,False,False,False,False,False,False,False,False
6996,False,False,False,False,False,False,False,False
6997,False,False,False,False,False,False,False,False
6998,False,False,False,False,False,False,False,False
6999,False,False,False,False,False,False,False,False

In [5]:

df.isnull().sum()

Student ID             0
Gender                 0
Age                    0
School                 0
Math Score           358
Reading Score        345
Writing Score        337
Class Performance      0
dtype: int64

In [6]:
df.isnull().sum().sum()

1040

In [7]:
df['Math Score'] = df['Math Score'].fillna(df['Math Score'].mean())

In [8]:
df.isnull().sum()

Student ID             0
Gender                 0
Age                    0
School                 0
Math Score             0
Reading Score        345
Writing Score        337
Class Performance      0
dtype: int64

In [9]:
df['Reading Score'] = df['Reading Score'].fillna(df['Reading Score'].median())

In [10]:
df.isnull().sum()

Student ID             0
Gender                 0
Age                    0
School                 0
Math Score             0
Reading Score          0
Writing Score        337
Class Performance      0
dtype: int64

In [11]:
df['Writing Score'] = df['Writing Score'].fillna(df['Writing Score'].min())

In [12]:
df.isnull().sum()

Student ID           0
Gender               0
Age                  0
School               0
Math Score           0
Reading Score        0
Writing Score        0
Class Performance    0
dtype: int64

In [13]:
df.dtypes

Student ID             int64
Gender                object
Age                    int64
School                object
Math Score           float64
Reading Score        float64
Writing Score        float64
Class Performance     object
dtype: object

In [14]:
df.dtypes

Student ID             int64
Gender                object
Age                    int64
School                object
Math Score           float64
Reading Score        float64
Writing Score        float64
Class Performance     object
dtype: object

In [15]:

df['Age'] = df['Age'].astype('float')

In [16]:
df.dtypes

Student ID             int64
Gender                object
Age                  float64
School                object
Math Score           float64
Reading Score        float64
Writing Score        float64
Class Performance     object
dtype: object

In [17]:

df.describe()

        Student ID          Age   Math Score  Reading Score  Writing Score
count  7000.000000  7000.000000  7000.000000    7000.000000    7000.000000
mean   3500.500000    19.006286    80.463264      80.569143      79.316857
std    2020.870275     1.411874    12.812682      12.650435      13.173321
min       1.000000    17.000000    60.000000      60.000000      60.000000
25%    1750.750000    18.000000    70.000000      70.000000      68.000000
50%    3500.500000    19.000000    80.463264      80.000000      79.000000
75%    5250.250000    20.000000    90.000000      90.000000      90.000000
max    7000.000000    21.000000   150.000000     150.000000     149.000000

In [18]:
df['Age'] = df['Age'].astype('int')

In [19]:

df.dtypes

Student ID             int64
Gender                object
Age                    int64
School                object
Math Score           float64
Reading Score        float64
Writing Score        float64
Class Performance     object
dtype: object

In [20]:
df.count()

Student ID           7000
Gender               7000
Age                  7000
School               7000
Math Score           7000
Reading Score        7000
Writing Score        7000
Class Performance    7000
dtype: int64

In [21]:
df['Age'].value_counts()

Age
18    1455
21    1425
19    1397
20    1365
17    1358
Name: count, dtype: int64

In [22]:
df.describe

<bound method NDFrame.describe of       Student ID  Gender  Age School  Math Score  Reading Score
0              1    Male   18      C        99.0           94.0  \
1              2    Male   17      D        78.0           61.0
2              3  Female   21      B        67.0           95.0
3              4  Female   20      E        67.0           67.0
4              5  Female   20      B        66.0           81.0
...          ...     ...  ...    ...         ...            ...
6995        6996  Female   17      C        69.0           72.0
6996        6997  Female   21      E        70.0           79.0
6997        6998    Male   21      C        80.0           79.0
6998        6999    Male   20      A        74.0           80.0
6999        7000    Male   18      D        60.0          100.0

      Writing Score Class Performance
0              98.0                 C
1              98.0                 B
2              78.0                 A
3              86.0                 C
4              74.0                 B
...             ...               ...
6995           80.0                 C
6996          100.0                 C
6997           78.0                 B
6998           68.0                 A
6999           81.0                 A

[7000 rows x 8 columns]>

In [23]:

df['Class Performance'].value_counts()

Class Performance
A    1978
B    1689
D    1683
C    1650
Name: count, dtype: int64

In [24]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Student ID         7000 non-null   int64
 1   Gender             7000 non-null   object
 2   Age                7000 non-null   int64
 3   School             7000 non-null   object
 4   Math Score         7000 non-null   float64
 5   Reading Score      7000 non-null   float64
 6   Writing Score      7000 non-null   float64
 7   Class Performance  7000 non-null   object
dtypes: float64(3), int64(2), object(3)
memory usage: 437.6+ KB

In [25]:
# data normalization
def min_max_normalize(
    name: str
):
    df[ name ] = (df[ name ] - df[ name ].min()) / ( df[ name ].max() - df[ name ].min() )

In [26]:

min_max_normalize( "Age" )

In [27]:
df.loc[ df.Gender == "Male" , "Gender" ] = 0
df.loc[ df.Gender == "Female" , "Gender" ] = 1

In [28]:
df.describe()

        Student ID          Age   Math Score  Reading Score  Writing Score
count  7000.000000  7000.000000  7000.000000    7000.000000    7000.000000
mean   3500.500000     0.501571    80.463264      80.569143      79.316857
std    2020.870275     0.352968    12.812682      12.650435      13.173321
min       1.000000     0.000000    60.000000      60.000000      60.000000
25%    1750.750000     0.250000    70.000000      70.000000      68.000000
50%    3500.500000     0.500000    80.463264      80.000000      79.000000
75%    5250.250000     0.750000    90.000000      90.000000      90.000000
max    7000.000000     1.000000   150.000000     150.000000     149.000000

In [29]:

df

,Student ID,Gender,Age,School,Math Score,Reading Score,Writing Score,Class Performance
0,1,0,0.25,C,99.0,94.0,98.0,C
1,2,0,0.00,D,78.0,61.0,98.0,B
2,3,1,1.00,B,67.0,95.0,78.0,A
3,4,1,0.75,E,67.0,67.0,86.0,C
4,5,1,0.75,B,66.0,81.0,74.0,B
...,...,...,...,...,...,...,...,...
6995,6996,1,0.00,C,69.0,72.0,80.0,C
6996,6997,1,1.00,E,70.0,79.0,100.0,C
6997,6998,0,1.00,C,80.0,79.0,78.0,B
6998,6999,0,0.75,A,74.0,80.0,68.0,A
6999,7000,0,0.25,D,60.0,100.0,81.0,A

In [40]:
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()
df['Gender'] = label_encoder.fit_transform(df['Gender'])

In [44]:
df['Gender'].unique()

array([0])

In [42]:
df

,Student ID,Gender,Age,School,Math Score,Reading Score,Writing Score,Class Performance
0,1,0,0.25,C,99.0,94.0,98.0,C
1,2,0,0.00,D,78.0,61.0,98.0,B
2,3,0,1.00,B,67.0,95.0,78.0,A
3,4,0,0.75,E,67.0,67.0,86.0,C
4,5,0,0.75,B,66.0,81.0,74.0,B
...,...,...,...,...,...,...,...,...
6995,6996,0,0.00,C,69.0,72.0,80.0,C
6996,6997,0,1.00,E,70.0,79.0,100.0,C
6997,6998,0,1.00,C,80.0,79.0,78.0,B
6998,6999,0,0.75,A,74.0,80.0,68.0,A
6999,7000,0,0.25,D,60.0,100.0,81.0,A